{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "metadata": {
                "description": "Log Analytics Workspace Name"
            },
            "type": "String"
        }
    },
    "resources": [
        {
            "properties": {
                "category": "ASIM",
                "displayName": "Authentication ASIM filtering parser for AAD service principal sign-in logs",
                "query": "let AADSvcPrincipal=(starttime:datetime=datetime(null), endtime:datetime=datetime(null), targetusername_has:string=\"*\", disabled:bool=false){\n  AADServicePrincipalSignInLogs | where not(disabled)\n  // ************************************************************************* \n  //       <Prefilterring>\n  // *************************************************************************\n  | where \n    (isnull(starttime)   or TimeGenerated >= starttime)\n    and (isnull(endtime)     or TimeGenerated <= endtime) \n    and (targetusername_has=='*' or (ServicePrincipalName =~ targetusername_has))\n  // ************************************************************************* \n  //       </Prefilterring>\n  // ************************************************************************* \n  | extend\n      EventVendor = 'Microsoft'\n      , EventProduct = 'AAD'\n      , EventCount=int(1)\n      , EventSchemaVersion='0.1.0'\n      , EventResult = iff (ResultType ==0, 'Success', 'Failure')\n      //, EventResultDetails= ResultType\n      , EventOriginalResultDetails = coalesce(ResultDescription, ResultType)\n      , EventStartTime = TimeGenerated\n      , EventEndTime= TimeGenerated\n      , EventType= 'Logon'\n      , Location = todynamic(LocationDetails)\n      , TargetAppId = ResourceIdentity \n      , TargetAppName=ResourceDisplayName\n    , TargetUserType='ServicePrincipal'\n    , TargetUsername=ServicePrincipalName\n    , TargetUserId=ServicePrincipalId\n    , TargetUsernameType='Simple'\n    , TargetUserIdType='AADID'\n  | extend\n      SrcGeoCity=tostring(Location.city)\n      , SrcGeoCountry=tostring(Location.countryOrRegion)\n      , SrcGeoLatitude=toreal(Location.geoCoordinates.latitude)\n      , SrcGeoLongitude=toreal(Location.geoCoordinates.longitude)\n  | project-rename\n      EventOriginalUid =Id\n      , TargetSessionId=CorrelationId\n      , SrcDvcIpAddr=IPAddress\n      | lookup ASIM_AADSTSErrorCodes on ResultType\n  | project-reorder\n      TimeGenerated\n      ,EventProduct\n      , EventOriginalUid\n      , EventResult\n      //, EventResultDetails\n      , EventOriginalResultDetails\n      , EventStartTime\n      , EventEndTime\n      , TargetSessionId\n      , SrcGeoCity\n      , SrcGeoCountry\n      , TargetAppId\n      // ** Aliases\n      | extend \n        User=TargetUsername\n    , LogonTarget=ResourceIdentity\n    , Dvc=EventVendor};\nAADSvcPrincipal(starttime, endtime, targetusername_has, disabled)",
                "functionAlias": "vimAuthenticationAADServicePrincipalSignInLogs",
                "functionParameters": "starttime:datetime=datetime(null),endtime:datetime=datetime(null),targetusername_has:string='*',disabled:bool=False",
                "version": 2
            },
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/vimauthenticationaadserviceprincipalsigninlogs')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/savedSearches",
            "apiVersion": "2020-08-01"
        }
    ]
}
